USE AccountOMS
GO
CREATE TABLE #tPeople(CodeM CHAR(6), Fam VARCHAR(50),Im VARCHAR(50),Ot VARCHAR(50),BirthDay VARCHAR(2),BirthMonth VARCHAR(2), BirthYear CHAR(4),DR AS BirthYear+RIGHT('0'+BirthMonth,2)+RIGHT('0'+BirthDay,2) )

INSERT #tPeople( CodeM, Fam, Im, Ot,BirthDay,BirthMonth,BirthYear )
VALUES ('184603','Жадаев','Николай','Николаевич',4,4,1929),
('184603','Богданова','Татьяна','Филлиповна',23,1,1933),
('184603','Бережной','Владимир','Александрович',30,1,1959),
('184603','Поташова','Инна','Евгеньевна',27,3,1960),
('184603','Селиванов','Михаил','Иванович',26,6,1935),
('184603','Ясько','Лариса','Антоновна',12,6,1939),
('184603','Урываев','Алексей','Владимирович',9,6,1981),
('184603','Григорьев','Юрий','Иосифович',20,8,1938),
('184603','Пискунов','Валерий','Александрович',2,11,1948),
('184603','Темникова','Маргарита','Александровна',31,3,1936),
('184603','Бирюкова','Любовь','Ивановна',14,3,1941),
('184603','Тусеева','Оксана','Павловна',7,1,1971),
('184603','Журавлева','Наталья','Александровна',31,10,1975),
('184603','Стрелка','Людмила','Николаевна',28,12,1962),
('184603','Поляков','Геннадий','Васильевич',15,8,1950),
('184603','Бабкина','Галина','Сергеевна',14,3,1957),
('184603','Щакина','Алевтина','Петровна',21,7,1939),
('184603','Коновалова','Вера','Тимофеевга',21,9,1921),
('184603','Горина','Нина','Павловна',27,2,1939),
('184603','Тюпаев','Юрий','Алексеевич',5,10,1937),
('184603','Комиссарова','Елена','Ивановна',2,5,1969),
('184603','Аснин','Лев','Иосифович',3,3,1932),
('184603','Сорокина','Ирина','Витальевна',23,12,1981),
('184603','Ильина','Виктория','Вадимовна',21,6,1987),
('184603','Хелевина','Мария','Алексеевна',17,8,1986),
('184603','Бахолдина','Елена','Львовна',28,1,1962),
('184603','Патрина','Мария','Сергеевна',15,7,1935),
('184603','Кобызева','Ольга','Юрьевна',9,9,1981),
('184603','Котельников','Евгений','Алекснадрович',29,11,1941),
('184603','Естрин','Марк','Борисович',26,11,1968),
('184603','Казаков','Александр','Иванович',19,6,1941),
('184603','Захаров','Роман','Викторович',20,6,1968),
('184603','Белоус','Анастасия','Игоревна',26,3,1993),
('184603','Креван','Наталия','Анатольевна',8,8,1957),
('184603','Маркова','Галина','Петровна',14,6,1939),
('184603','Калашник','Светлана','Алексеевна',28,12,1968),
('184603','Клименко','Галина','Николаевна',10,4,1965),
('184603','Гурова','Валерия','Витальевна',4,11,1992),
('184603','Жуков','Николай','Владимирович',1,11,1965),
('184603','Сотников','Геннадий','Александрович',5,10,1959),
('184603','Платов','Алексей','Станиславович',5,3,1971),
('184603','Мудрая','Наталья','Алексеевна',17,1,1980),
('184603','Семенов','Сергей','Всеволодович',17,7,1956),
('184603','Духнич','Евгений','Иванович',4,9,1941),
('184603','Амвросов','Константин','Алексеевич',1,8,1953),
('184603','Папава','Лела','Яговна',27,12,1980),
('184603','Врублевский','Дмитрий','Владимирович',23,6,1977),
('184603','Белозубов','Юрий','Владимирович',17,2,1983),
('184603','Кудрявцева','Светлана','Алексеевна',7,1,1953),
('184603','Гурьева','Наталья','Николаевна',20,4,1950),
('184603','Решетников','Алексей','Сергеевич',22,9,1989),
('184603','Ганотченко','Вера','Васильевна',13,12,1968),
('184603','Мануйлов','Ярослав','Александрович',26,10,1989),
('184603','Нестерец','Нина','Анатольевна',20,6,1950),
('184603','Дуданова','Нина','Владимировна',28,8,1962),
('184603','Ептанская','Мария','Александровна',12,4,1992),
('184603','Шведова','Вера','Афанасьевна',30,4,1953),
('184603','Рубаев','Антон','Магомеднуриевич',1,2,1992),
('184603','Хачатурова','Ирина','Ивановна',9,5,1962),
('184603','Бударин','Евгений','Евгеньевич',25,5,1989),
('184603','Сивов','Александр','Петрович',28,7,1986),
('184603','Саламатин','Олег','Ювенальевич',1,4,1950),
('184603','Преснова','Изабелла','Давыдовна',5,3,1953),
('184603','Шварева','Наталья','Константиновна',20,6,1974),
('184603','Беликова','Ирина','Александровна',25,2,1968),
('184603','Якимов','Алексей','Григорьевич',18,2,1974),
('184603','Титов','Павел','Николаевич',26,8,1971),
('184603','Чезенкова','Татьяна','Анатольевна',17,1,1947),
('184603','Арсентьев','Павел','Павлович',24,5,1983),
('184603','Сударикова','Светлана','Васильевна',7,12,1965),
('184603','Русанов','Глеб','Владимирович',23,12,1992),
('184603','Плешакова','Ольга','Ивановна',16,11,1971),
('184603','Хрисшов','Павел','Павлинович',28,7,1989),
('184603','Архипова','Наталия','Владимровна',24,9,1989),
('184603','Емельянова','Нина','Владимировна',13,2,1989),
('184603','Кобзева','Нина','Дмитриевна',26,2,1935),
('184603','Шилов','Владислав','Георгиевич',21,9,1968),
('184603','Проничев','Дмитрий','Владимирович',19,1,1971),
('184603','Голтвенко','Александр','Александрович',17,3,1974),
('184603','Давыденко','Артур','Александрович',7,12,1992),
('184603','Ильина','Алевтина','Ивановна',19,2,1944),
('184603','Архангельская','Анна','Александровна',4,12,1989),
('184603','Хорт','Елена','Рудольфовна',27,4,1953),
('184603','Боева','Татьяна','Алексеевна',17,5,1983),
('184603','Ченцова','Анна','Валентиновна',29,4,1980),
('184603','Лукин','Петр','Александрович',17,5,1980),
('184603','Латышева','Татьяна','Сергеевна',11,3,1947),
('184603','Лавров','Петр','Павлович',23,3,1974),
('184603','Володькина','Галина','Валентиновна',2,12,1953),
('184603','Грехов','Ростислав','Александрович',15,6,1962),
('184603','Матанина','Надежда','Викторовна',14,11,1956),
('184603','Еремин','Геннадий','Александрович',22,7,1950),
('184603','Ушаков','Геннадий','Александрович',18,5,1947),
('184603','Салазникова','Ольга','Анатольевна',8,8,1965),
('184603','Киселев','Валерий','Николаевич',4,4,1953),
('184603','Виноградов','Андрей','Васильевич',5,12,1962),
('184603','Тараскина','Ольга','Петровна',10,11,1983),
('184603','Назарова','Людмила','Васильевна',28,11,1959),
('184603','Михальчев','Алексей','Юрьевич',14,9,1965),
('184603','Якупов','Сергей','Идиялович',17,11,1956),
('184603','Калядин','Алексей','Владимирович',18,6,1974),
('184603','Савостина','Надежда','Яковлевна',8,9,1941),
('184603','Беркута','Юрий','Николаевич',18,6,1974),
('184603','Фолиянц','Константин','Александрович',8,4,1992),
('184603','Ставинский','Владимир','Александрович',28,3,1941),
('184603','Камышова','Ольга','Витальевна',31,10,1962),
('184603','Попенко','Ольга','Евгеньевна',18,9,1971),
('184603','Сахарова','Людмила','Михайловна',15,5,1950),
('184603','Ерошенко','Ольга','Владимировна',11,11,1980),
('184603','Михайлов','Константин','Борисович',8,6,1968),
('184603','Пугач','Ольга','Яковлевна',14,8,1944),
('184603','Тарасова','Елена','Федоровна',9,3,1950),
('184603','Скрипкина','Наталья','Михайловна',21,4,1947),
('184603','Благов','Игорь','Сергеевич',1,10,1986),
('184603','Галушкина','Надежда','Владимировна',17,5,1983),
('184603','Глоба','Сергей','Викторович',18,1,1968),
('184603','Пояркова','Кристина','Викторовна',14,6,1992),
('184603','Ким','Константин','Игоревич',1,10,1986),
('184603','Бережной','Владимир','Алексеевич',30,1,1959),
('184603','Зеленская','Валентина','Дмитриевна',20,5,1947),
('184603','Гришин','Александр','Геннадьевич',6,5,1971),
('184603','Кобозева','Надежда','Петровна',11,9,1953),
('184603','Евграфова','Валентина','Федоровна',1,10,1947),
('184603','Бирюкова','Людмила','Ивановна',6,1,1950),
('184603','Ковиненко','Светлана','Александровна',1,6,1962),
('184603','Литвинова','Светлана','Константиновна',17,2,1941),
('184603','Майшек','Светлана','Николаевна',2,12,1986),
('184603','Егоров','Александр','Витальевич',26,4,1980),
('184603','Василенко','Екатерина','Сергеевна',9,4,1983),
('184603','Макаров','Максим','Александрович',2,11,1980),
('184603','Олейникова','Елена','Геннадьевна',3,1,1965),
('184603','Матвеева','Мария','Павловна',10,2,1983),
('184603','Романенко','Ольга','Юрьевна',12,6,1959),
('184603','Алексина','Надежда','Владимировна',6,11,1989),
('184603','Никипелов','Николай','Андреевич',5,4,1989),
('184603','Сухов','Александр','Александрович',28,6,1968),
('184603','Гладкова','Яна','Георгиевна',22,10,1983),
('184603','Князева','Екатерина','Сергеевна',19,9,1983),
('184603','Элоян','Оганез','Вартанович',12,7,1986),
('184603','Селезнева','Надежда','Ивановна',22,11,1950),
('184603','Пронин','Александр','Александрович',8,9,1989),
('184603','Голов','Алексей','Николаевич',10,4,1974),
('184603','Адамян','Ольга','Арамовна',21,1,1950),
('184603','Ганьшин','Константин','Владимирович',19,2,1983),
('184603','Вакина','Анна','Анатольевна',30,3,1986),
('184603','Хабарова','Оксана','Вячеславовна',17,5,1983),
('184603','Андриенко','Аркадий','Георгиевич',26,2,1950),
('184603','Селянинова','Яна','Юрьевна',23,6,1973),
('184603','Иванова','Валентина','Васильевна',9,8,1950),
('184603','Немухина','Надежда','Васильевна',8,12,1971),
('184603','Егоров','Александр','Валентинович',4,12,1971),
('184603','Журавлев','Анатолий','Анатольевич',30,3,1950),
('184603','Погребняк','Наталья','Александровна',5,11,1983),
('184603','Дьяконова','Карина','Дмитриевна',4,7,1987),
('184603','Ястребов','Вадим','иванович',10,4,1950),
('184603','Машкоук','Камаль','Мохаммед',24,2,1953),
('184603','Хриченко','Наталья','Анатольевна',26,9,1977),
('184603','Артюшина','Екатерина','Александровна',19,6,1983),
('184603','Степкин','Василий','Сергеевич',29,4,1986),
('184603','Волков','Олег','Игоревич',7,11,1968),
('184603','Трушечкин','Ростислав','Борисович',27,9,1983),
('184603','Карпенко','Божена','Андреевна',15,9,1986),
('184603','Шаколис','Ионас','Ионасович',16,4,1968),
('184603','Галишникова','Наталья','Андреевна',2,4,1983),
('184603','Митина','Ольга','Николаевна',1,6,1953),
('184603','Колесникова','Елизавета','Владимировна',30,11,1986),
('184603','Осипова','Наталья','Федоровна',7,9,1968),
('184603','Колосова','Екатерина','Сергеевна',2,12,1989),
('184603','Пискун','Федор','Степанович',5,3,1968),
('184603','Кухаркина','Полина','Михайловна',23,4,1986),
('184603','Кисиленко','Наталия','Владиславовна',9,12,1989)



--SELECT CodeM,Fam,Im,Ot,BirthYear+RIGHT('0'+BirthMonth,2)+RIGHT('0'+BirthDay,2) FROM #tPeople

SELECT DISTINCT a.Account,a.DateRegister
		,c.idRecordCase
		,v6.name AS V6
		,v8.Name AS V8
		,f.CodeM
		,l.NAMES AS LPU
		,pt.Fam+' '+pt.Im+' '+pt.Ot AS Fio,p.Sex,p.BirthDay,r.NumberPolis
		,c.DateBegin,c.DateEnd
		,v9.name AS RSLT
		,d.DS1,mkb10.Diagnosis
		,CAST(c.AmountPayment AS MONEY) AS AmountPayment
		,v2.name AS V002
		,0 AS Tariff
		,c.NumberHistoryCase		
		,v12.name AS ISHOD
		,v4.name AS PRVS
		,v10.name AS V10
		,r.AttachLPU	
		,ISNULL(e.AmountDeduction,0),ISNULL(e.Name,''),ISNULL(e.DocumentNumber,'')
		--,pt.id
FROM dbo.t_File f INNER JOIN dbo.t_RegistersAccounts a ON
			f.id=a.rf_idFiles				
				INNER JOIN dbo.t_RecordCasePatient r ON
		a.id=r.rf_idRegistersAccounts
				INNER JOIN dbo.t_RegisterPatient p ON
		r.id=p.rf_idRecordCase
		AND f.id=p.rf_idFiles		
				INNER JOIN #tPeople pt ON
		p.Fam=pt.Fam
		AND p.Im=pt.Im
		AND ISNULL(p.Ot,pt.Ot)=pt.Ot
		AND p.BirthDay=pt.DR
		AND f.CodeM=pt.CodeM
				INNER JOIN dbo.t_Case c  ON
		r.id=c.rf_idRecordCasePatient	
				INNER JOIN dbo.vw_Diagnosis d ON
		c.id=d.rf_idCase
				INNER JOIN dbo.vw_sprMKB10 mkb10 ON
		d.DS1=mkb10.DiagnosisCode			
				INNER JOIN RegisterCases.dbo.vw_sprV009 v9 ON
		c.rf_idV009=v9.id
				INNER JOIN RegisterCases.dbo.vw_sprV012 v12 ON
		c.rf_idV012=v12.id		
				INNER JOIN RegisterCases.dbo.vw_sprV004 v4 ON
		c.rf_idV004=v4.id		
				INNER JOIN RegisterCases.dbo.vw_sprV002 v2 ON
		c.rf_idV002=v2.id
				INNER JOIN RegisterCases.dbo.vw_sprV006 v6 ON
		c.rf_idV006=v6.id
				INNER JOIN RegisterCases.dbo.vw_sprV08 v8 ON
		c.rf_idV008=v8.id
				INNER JOIN dbo.vw_sprT001 l ON
		f.CodeM=l.CodeM
				INNER JOIN RegisterCases.dbo.vw_sprV010 v10 ON
		c.rf_idV010=v10.id	
				left JOIN (SELECT c.rf_idCase,c.AmountMEK+c.AmountMEE+c.AmountEKMP AS AmountDeduction,t.Name,d.DocumentNumber
							FROM ExchangeFinancing.dbo.t_DocumentOfCheckup d INNER JOIN ExchangeFinancing.dbo.t_CheckedAccount a ON
										d.id=a.rf_idDocumentOfCheckup
													INNER JOIN ExchangeFinancing.dbo.t_CheckedCase c ON
										a.id=c.rf_idCheckedAccount
													INNER JOIN ExchangeFinancing.dbo.vw_sprTypeCheckup t ON
										d.TypeCheckup=t.id
							) e ON
		c.id=e.rf_idCase
WHERE f.DateRegistration>='20130101' AND f.DateRegistration<'20140601' AND a.Letter='O'
--ORDER BY id
GO
DROP TABLE #tPeople