USE AccountOMS
GO
DECLARE @dtStart DATETIME='20150101',
		@dtEnd DATETIME='20170301 23:59:59'

SELECT f.Fam,f.Im,CASE WHEN f.OT='' THEN NULL ELSE f.Ot END AS OT , CONVERT(DATE,f.DR,104) AS Dr
into #tmpPeople
FROM ( values('Носова','Светлана','Александровна','14.11.1965'),
('Иванова','Ирина','Анатольевна','04.04.1967'),
('Кузнецова','Ольга','Михайловна','14.06.1969'),
('Левушкина','Елена','Викторовна','25.05.1975'),
('Храмова','Ирина','Станиславовна','21.08.1965'),
('Головцова','Ирина','Александровна','26.03.1965'),
('Шакирова','Ирина','Сергеевна','07.04.1982'),
('Сысоева','Любовь','Юрьевна','22.12.1962'),
('Фокина','Татьяна','Викторовна','06.12.1986'),
('Селюнова','Надежда','Викторовна','11.05.1967'),
('Анашкина','Надежда','Николаевна','15.04.1980'),
('Бондарева','Галина','Викторовна','30.04.1961'),
('Трещева','Ольга','Геннадьевна','19.10.1977'),
('Филатова','Татьяна','Геннадьевна','22.11.1963'),
('Кисленко','Ирина','Викторовна','10.10.1962'),
('Поминова','Наталья','Игоревна','19.04.1975'),
('Чкалова','Лариса','Георгиевна','22.05.1978'),
('Климова','Светлана','Александровна','28.08.1965'),
('Воронина','Ирина','Николаевна','24.09.1973'),
('Артемова','Наталия','Александровна','05.01.1975'),
('Острик','Ирина','Петровна','15.07.1964'),
('Шлеер','Светлана','Александровна','13.08.1970'),
('Кулясова','Ольга','Евгеньевна','07.03.1973'),
('Алексеева','Светлана','Юрьевна','01.08.1979'),
('Колесникова','Людмила','Юрьевна','26.08.1966'),
('Суворова','Юлия','Борисовна','09.05.1976'),
('Мазаева','Наталья','Сергеевна','13.12.1977'),
('Величкович','Нелля','Константиновна','13.09.1968'),
('Агапова','Людмила','Викторовна','20.07.1967'),
('Головачева','Наталья','Николаевна','15.08.1963'),
('Затенко','Екатерина','Олеговна','28.12.1986'),
('Харина','Наталья','Петровна','28.04.1979'),
('Кораблинова','Вероника','Владимировна','28.06.1976'),
('Киселева','Светлана','Владимировна','05.06.1968'),
('Соснина','Инна','Анатольевна','25.03.1968'),
('Акопян','Александра','Александровна','08.07.1981'),
('Цупикова','Людмила','Анатольевна','05.08.1974'),
('Мозговенко','Татьяна','Ивановна','13.05.1984'),
('Мурашкина','Вероника','Григорьевна','06.03.1981'),
('Мышкина','Любовь','Владимировна','09.05.1974'),
('Сорокина','Татьяна','Владимировна','11.06.1987'),
('Устинова','Елена','Валентиновна','26.10.1972'),
('Палентерова','Наталья','Николаевна','08.10.1970'),
('Безвуденко','Наталья','Викторовна','26.10.1978'),
('Чистопашина','Инна','Сергеевна','12.09.1975'),
('Ротарь','Елена','Евгеньевна','26.10.1979'),
('Пономарева','Марина','Михайловна','08.10.1971'),
('Мангутова','Ольга','Николаевна','21.07.1972'),
('Харитонова','Елена','Михайловна','20.01.1973'),
('Токарева','Татьяна','Петровна','15.08.1978'),
('Володченкова','Надежда','Владимировна','04.09.1972'),
('Юдкина','Нина','Николаевна','28.03.1964'),
('Бачурина','Елена','Александровна','01.09.1979'),
('Сайпиева','Светлана','Константиновна','22.12.1971'),
('Лоус','Татьяна','Ивановна','06.02.1961'),
('Яценко','Татьяна','Александровна','21.03.1966'),
('Теплякова','Татьяна','Михайловна','17.12.1981'),
('Серякова','Елена','Владимировна','30.05.1972'),
('Чакмина','Наталья','Владимировна','05.04.1975'),
('Фомиченко','Сания','Абдулкадыровна','06.11.1963'),
('Матвиенко','Анна','Юрьевна','26.11.1986'),
('Васильева','Василиса','Владимировна','13.06.1985'),
('Шахворостова','Надежда','Викторовна','22.05.1967'),
('Фатеева','Светлана','Николаевна','06.04.1974'),
('Шевченко','Галина','Васильевна','18.12.1973'),
('Чумак','Валентина','Владимировна','04.09.1966'),
('Кучерявенко','Любовь','Михайловна','21.09.1961'),
('Тарасова','Наталья','Александровна','07.05.1983'),
('Голобченко','Зинаида','Дмитриевна','15.09.1967'),
('Фомина','Елена','Александровна','21.11.1982'),
('Кончакова','Марина','Валериевна','08.02.1979'),
('Глазунова','Елена','Александровна','06.04.1980'),
('Панкратова','Надежда','Львовна','07.02.1971'),
('Савчук','Людмила','Николаевна','08.04.1963'),
('Изоткина','Галина','Валерьевна','03.01.1971'),
('Головкова','Ольга','Викторовна','05.07.1971'),
('Исаева','Светлана','Александровна','04.03.1969'),
('Шалаева','Вероника','Александровна','01.07.1965'),
('Варыгина','Ольга','Леонидовна','30.07.1980'),
('Артемьева','Марина','Александровна','21.02.1968'),
('Беженцева','Елена','Валентиновна','28.08.1967'),
('Боровикова','Елена','Яковлевна','12.05.1980'),
('Гончарова','Елена','Алексеевна','19.10.1976'),
('Бибарцева','Диана','Николаевна','12.05.1976'),
('Протопопова','Марина','Игоревна','12.02.1973'),
('Овчинникова','Ульяна','Алексеевна','21.06.1970'),
('Тишкевич','Александра','Александровна','16.03.1971'),
('Хохлова','Елена','Дмитриевна','07.11.1967'),
('Голунова','Екатерина','Сергеевна','27.10.1989'),
('Борисова','Елена','Сергеевна','24.11.1985'),
('Коткова','Лилия','Геннадьевна','28.08.1980'),
('Лазарева','Дина','Олеговна','07.01.1976'),
('Мосалова','Ольга','Валерьевна','16.03.1973'),
('Толстопятова','Юлия','Вадимовна','22.03.1980'),
('Кузнецова','Евгения','Ивановна','15.09.1974'),
('Ковригина','Онега','Владимировна','18.05.1968'),
('Хорахоркина','Евгения','Викторовна','09.07.1984'),
('Подковырова','Наталья','Михайловна','10.12.1975'),
('Присекина','Вера','Николаевна','20.06.1967'),
('Чихирева','Юлия','Викторовна','20.02.1980'),
('Вершинина','Татьяна','Евгеньевна','16.05.1968'),
('Дубовченко','Виктория','Валерьевна','19.09.1973')) f(Fam,Im,Ot,DR)


SELECT distinct c.id, c.GUID_Case,a.rf_idSMO, l.NAMES,a.Account,a.DateRegister,f.DateRegistration
		,c.idRecordCase,d.DS1,mkb10.Diagnosis,CAST(c.AmountPayment AS MONEY) AS AmountPayment,v2.name AS PROFIL
		,0 AS Tariff,c.NumberHistoryCase,c.DateBegin,c.DateEnd,v9.name AS RSLT,v12.name AS ISHOD,v4.name AS PRVS
		,p.Fam+' '+p.Im+' '+p.Ot AS Fio,p.Sex,p.BirthDay,c.Age,r.NumberPolis,v6.name AS USL_OK,
		c.AmountPayment AS AmountDeduction, r.AttachLPU,ll.NAMES AS LPUAttach
INTO #tmpCases
FROM dbo.t_File f INNER JOIN dbo.t_RegistersAccounts a ON
			f.id=a.rf_idFiles				
				INNER JOIN dbo.t_RecordCasePatient r ON
		a.id=r.rf_idRegistersAccounts
				INNER JOIN dbo.t_RegisterPatient p ON
		r.id=p.rf_idRecordCase
		AND f.id=p.rf_idFiles				
				INNER JOIN dbo.t_Case c  ON
		r.id=c.rf_idRecordCasePatient	
				INNER JOIN dbo.vw_Diagnosis d ON
		c.id=d.rf_idCase
				INNER JOIN dbo.vw_sprMKB10 mkb10 ON
		d.DS1=mkb10.DiagnosisCode			
				INNER JOIN RegisterCases.dbo.vw_sprV009 v9 ON
		c.rf_idV009=v9.id
				INNER JOIN RegisterCases.dbo.vw_sprV012 v12 ON
		c.rf_idV012=v12.id		
				INNER JOIN RegisterCases.dbo.vw_sprV004 v4 ON
		c.rf_idV004=v4.id	
		AND c.DateEnd>=v4.DateBeg
		AND c.DateEnd<=v4.DateEnd	
				INNER JOIN RegisterCases.dbo.vw_sprV002 v2 ON
		c.rf_idV002=v2.id
				INNER JOIN dbo.vw_sprT001 l ON
		f.CodeM=l.CodeM		
				INNER JOIN RegisterCases.dbo.vw_sprV006 v6 ON
		c.rf_idV006=v6.id
				INNER JOIN #tmpPeople tp ON		
		p.Fam=tp.Fam
		AND p.Im=tp.Im
		AND p.Ot=ISNULL(tp.Ot,p.Ot)
		AND p.BirthDay=tp.Dr
						left JOIN dbo.vw_sprT001 ll ON
		r.AttachLPU=ll.CodeM
WHERE f.DateRegistration>=@dtStart AND f.DateRegistration<@dtEnd AND a.ReportYear>=2015 AND a.reportYear<2017
ORDER BY FIO,DateRegister

UPDATE p SET p.AmountDeduction=Deduction
FROM #tmpCases p INNER JOIN (SELECT c.rf_idCase,SUM(c.AmountDeduction) AS Deduction
								FROM ExchangeFinancing.dbo.t_AFileIn f INNER JOIN  ExchangeFinancing.dbo.t_DocumentOfCheckup d ON
														f.id=d.rf_idAFile
																	INNER JOIN ExchangeFinancing.dbo.t_CheckedAccount a ON
														d.id=a.rf_idDocumentOfCheckup
															INNER JOIN ExchangeFinancing.dbo.t_CheckedCase c ON
														a.id=c.rf_idCheckedAccount 																							
								WHERE f.DateRegistration>=@dtStart AND f.DateRegistration<'20170515 23:59:59' AND d.TypeCheckup=1
								GROUP BY c.rf_idCase
							) r ON
			p.id=r.rf_idCase

SELECT s.sNameS,Names,DateRegistration,Account,DateRegister,idRecordCase,DS1,Diagnosis,AmountPayment,USL_OK,PROFIL, NumberHistoryCase, 
		DateBegin,DateEnd,PRVS,Fio,BirthDay,Age,NumberPolis,LPUAttach 
FROM #tmpCases c INNER JOIN dbo.vw_sprSMO s ON
			c.rf_idSMO=s.smocod
WHERE AmountDeduction>0
go
DROP TABLE #tmpCases
DROP TABLE #tmpPeople