USE AccountOMS
GO
CREATE TABLE #tPeople(id TINYINT, Fam VARCHAR(50),Im VARCHAR(50),Ot VARCHAR(50),BirthYear int )

INSERT #tPeople( id, Fam, Im, Ot, BirthYear )
VALUES (1,'Абрамов','Леонид','Васильевич',1921),
(2,'Бирюков','Анастасия','Васильевна',1924),
(3,'Заверткина','Валентина','Степановна',1928),
(3,'Завярткина','Валентина','Степановна',1928),
(4,'Паненко','Владимир','Петрович',1925),
(5,'Белоусова','Валентина','Михайловна',1922),
(6,'Никитина','Анна','Петровна',1925),
(7,'Рогожин','Василий','Андреевич',1913),
(8,'Лазуренко','Лилия','Григорьевна',1923),
(9,'Бормина','Ольга','Дмитриевна',1921),
(9,'Бармина','Ольга','Дмитриевна',1921),
(10,'Шолохова','Александра','',1924),
(11,'Чередпиченко','Зоя','Матвеевна',1922),
(12,'Смирнов','Константин','Федорович',1920),
(13,'Израилет','Моисей','Гиршевич',1916),
(13,'Изряплет','Моисей','Гиршевич',1916),
(14,'Захаров','Георгий','Ильич',1920),
(15,'Гомзина','Александра','Владимировна',1923),
(16,'Ильин','Ростислав','Кузьмич',1925),
(17,'Володина','Галина','Дмитриевна',1926),
(18,'Давыдова','Анна','Васильевна',1922),
(19,'Ивлева','Евлампия','Григорьевна',1925),
(20,'Кондрашова','Клавдия','Петровна',1923),
(21,'Константинова','Ольга','Петровна',1922),
(22,'Кожина','Татьяна','Ивановна',1923),
(23,'Кулакова','Лидия','Егоровна',1931),
(24,'Манько','Мария','Сергеевна',1923),
(25,'Приходько','Лариса','Андреевна',1924),
(26,'Никифорова','Вера','Васильевна',1924),
(27,'Шишова','Вера','Сергеевна',1926),
(28,'Коява','Александра','Александровна',1921),
(29,'Белов','Евгений','Степанович',1922),
(30,'Иванов','Бориса','Григорьевич',1925),
(31,'Пропекал','Анна','Моисеевна',1922),
(32,'Ташкова','Мария','Ивановна',1924),
(33,'Чернецова','Галина','Александровна',1924),
(34,'Воронков','Александр','Васильевич',1922),
(35,'Балякин','Михаил','Иванович',1922),
(35,'Белякин','Михаил','Иванович',1922),
(36,'Татаринова','Нина','Семеновна',1920),
(37,'Щипцов','Иван','Федорович',1924),
(38,'Бойцова','Лидия','Алексеевна',1922),
(39,'Кобзев','Анатолий','Васильевич',1920),
(40,'Лысенко','Федор','Макарович',1922),
(41,'Неверов','Николай','Васильевич',1924),
(42,'Сентурина','Идея','Ильинична',1924),
(42,'Сентирина','Идея','Ильинична',1924),
(43,'Дудкин','Евгений','Васильевич',1923),
(44,'Альбанов','Виктор','Александрович',1915),
(45,'Кузнецов','Василий','Павлович',1926),
(46,'Семенов','Анатолий','Акимович',1925),
(47,'Уразов','Александр','Прокофьевич',1921),
(48,'Баранов','Александр','Константинович',1923),
(49,'Кудлаев','Александр','Васильевич',1922),
(50,'Хмерин','Василий','Михайлович',1923),
(51,'Ананьев','Владимир','Федорович',1922),
(52,'Алоянцева','Вера','Андреевна',1922),
(53,'Прокофьев','Анатолий','Георгиевич',1922),
(54,'Ушаков','Федор','Алексеевич',1919),
(55,'Крутов','Николай','Несторович',1921),
(56,'Дынкин','Константин','Васильевич',1920),
(57,'Родионов','Никита','Григорьевич',1915),
(58,'Оконченко','Григорий','Гаврилович',1927),
(59,'Панченко','Юрий','Николаевич',1927),
(60,'Яранцев','Валерий','Васильевич',1923),
(61,'Чижанова','Варвара','Никитична',1917),
(62,'Кузнецова','Августа','Николаевна',1924),
(63,'Маркова','Надежда','Родионовна',1922),
(64,'Петрова','Инна','Ивановна',1919),
(65,'Гаврилов','Борис','Илларионович',1922),
(66,'Воробьев','Николай','Егорович',1926),
(67,'Аушев','Сергей','Григорьевич',1923),
(68,'Битюцкий','Василий','Дмитриевич',1923),
(69,'Боготырев','Петр','Сергеевич',1925),
(69,'Богатырев','Петр','Сергеевич',1925),
(70,'Корольков','Геннадий','Васильевич',1924),
(71,'Коньков','Александр','Иванович',1923),
(72,'Кобелев','Семен','Кириллович',1920),
(73,'Набережный','Степан','Егорович',1924),
(74,'Кукушкин','Михаил','Федорович',1924),
(75,'Головина','Клавдия','Никитична',1923),
(76,'Зыков','Николай','Нестерович',1923),
(77,'Иващенко','Григорий','Гаврилович',1922),
(78,'Гудзев','Георгий','Федотович',1920),
(79,'Пироженко','Инна','Васильевна',1922),
(80,'Гомосков','Виктор','Александрович',1918),
(81,'Чумаченко','Валентина','Ануфриевна',1923),
(82,'Дмитриев','Василий','Евдокимович',1923),
(83,'Белозерова','Лидия','Дмитриевна',1926)


SELECT a.Account,a.DateRegister
		,c.idRecordCase
		,v6.name AS V6
		,v8.Name AS V8
		,f.CodeM
		,l.NAMES AS LPU
		,ISNULL(p.Fam+' '+p.Im+' '+p.Ot,'Неизвестно') AS Fio,p.Sex,p.BirthDay,r.NumberPolis
		,c.DateBegin,c.DateEnd
		,v9.name AS RSLT
		,d.DS1,mkb10.Diagnosis
		,CAST(c.AmountPayment AS MONEY) AS AmountPayment
		,v2.name AS V002
		,0 AS Tariff
		,c.NumberHistoryCase		
		,v12.name AS ISHOD
		,v4.name AS PRVS
		,v10.name AS V10
		,r.AttachLPU	
		,e.AmountDeduction,e.Name,e.DocumentNumber	
		,pt.id
FROM dbo.t_File f INNER JOIN dbo.t_RegistersAccounts a ON
			f.id=a.rf_idFiles				
				INNER JOIN dbo.t_RecordCasePatient r ON
		a.id=r.rf_idRegistersAccounts
				INNER JOIN dbo.t_RegisterPatient p ON
		r.id=p.rf_idRecordCase
		AND f.id=p.rf_idFiles		
				INNER JOIN #tPeople pt ON
		p.Fam=pt.Fam
		AND p.Im=pt.Im
		AND ISNULL(p.Ot,pt.Ot)=pt.Ot
		AND YEAR(p.BirthDay)=pt.BirthYear
				INNER JOIN dbo.t_Case c  ON
		r.id=c.rf_idRecordCasePatient	
				INNER JOIN dbo.vw_Diagnosis d ON
		c.id=d.rf_idCase
				INNER JOIN dbo.vw_sprMKB10 mkb10 ON
		d.DS1=mkb10.DiagnosisCode			
				INNER JOIN RegisterCases.dbo.vw_sprV009 v9 ON
		c.rf_idV009=v9.id
				INNER JOIN RegisterCases.dbo.vw_sprV012 v12 ON
		c.rf_idV012=v12.id		
				INNER JOIN RegisterCases.dbo.vw_sprV004 v4 ON
		c.rf_idV004=v4.id		
				INNER JOIN RegisterCases.dbo.vw_sprV002 v2 ON
		c.rf_idV002=v2.id
				INNER JOIN RegisterCases.dbo.vw_sprV006 v6 ON
		c.rf_idV006=v6.id
				INNER JOIN RegisterCases.dbo.vw_sprV08 v8 ON
		c.rf_idV008=v8.id
				INNER JOIN dbo.vw_sprT001 l ON
		f.CodeM=l.CodeM
				INNER JOIN RegisterCases.dbo.vw_sprV010 v10 ON
		c.rf_idV010=v10.id	
				inner JOIN (SELECT c.rf_idCase,c.AmountMEK+c.AmountMEE+c.AmountMEK AS AmountDeduction,t.Name,d.DocumentNumber
							FROM ExchangeFinancing.dbo.t_DocumentOfCheckup d INNER JOIN ExchangeFinancing.dbo.t_CheckedAccount a ON
										d.id=a.rf_idDocumentOfCheckup
													INNER JOIN ExchangeFinancing.dbo.t_CheckedCase c ON
										a.id=c.rf_idCheckedAccount
													INNER JOIN ExchangeFinancing.dbo.vw_sprTypeCheckup t ON
										d.TypeCheckup=t.id
							) e ON
		c.id=e.rf_idCase
WHERE f.DateRegistration>='20130101' AND f.DateRegistration<'20140511'   AND a.Letter='O'
ORDER BY id
GO
DROP TABLE #tPeople