USE AccountOMS
GO
CREATE TABLE #searchPeople(PID INT,Fam VARCHAR(30),Im VARCHAR(30),OT VARCHAR(30),DR DATE)

INSERT #searchPeople( PID, Fam, Im, OT, DR )
SELECT v.PID,v.Fam,v.IM,v.Ot,CAST(DATEADD(DAY,-2,cast(v.DR AS datetime)) AS DATE)
FROM (VALUES  (36919,'ÐÅÄ×ÅÍÊÎÂÀ','ÒÀÒÜßÍÀ','ÅÃÎÐÎÂÍÀ',5125),
(48867,'ÏÅÐÖÎÂÀ','ÌÀÒÐÅÍÀ','ÇÀÕÀÐÎÂÍÀ',5060),
(52501,'ÊÎÏÛËÎÂÀ','ÅÊÀÒÅÐÈÍÀ','ÄÅßÍÎÂÍÀ',5455),
(98592,'ÅÐÌÀÊÎÂÀ','ÍÀÄÅÆÄÀ','ÃÀÂÐÈËÎÂÍÀ',4660),
(125582,'ÕÀÉÐÓËÈÍÀ','ÕÀËÈÑÀ','ÍÈÇÀÌÄÈÍÎÂÍÀ',5451),
(147520,'ÅÂÑÒÐÀÒÎÂÀ','ÅÔÐÎÑÈÍÜß','ÕÀÐÈÒÎÍÎÂÍÀ',4285),
(157102,'ÃÐÅÁÅÍÍÈÊÎÂÀ','ÏÐÀÑÊÎÂÜß','ÅÂÑÅÅÂÍÀ',5431),
(139614,'ÊÎËÏÀÊÎÂÀ','ÏÅËÎÃÅß','ÀÔÀÍÀÑÜÅÂÍÀ',4200),
(119391,'ÙÅÐÁÀÊÎÂÀ','ÅÊÀÒÅÐÈÍÀ','ÔÐÎËÎÂÍÀ',5296),
(198672,'ÑÅËÈÂÀÍÎÂÀ','ÌÀÐÈß','ÃËÅÁÎÂÍÀ',3835),
(118788,'ßÖÊÎÂ','ÌÈÕÀÈË','ÀÊÈÌÎÂÈ×',5059),
(89383,'ÏÎÄÃÎÐÍÀß','ÌÀÒÐÅÍÀ','ÂÀÑÈËÜÅÂÍÀ',5420),
(88112,'ÀÍÄÐÅÅÂÀ','ÐÀÈÑÀ','ÍÈÊÎËÀÅÂÍÀ',5173),
(228704,'ÀÂÄÅÅÂ','ÈËÜß','ÃÅÎÐÃÈÅÂÈ×',4959),
(229837,'ËÎÁÀÍÎÂÀ','ÅÂÃÅÍÈß','ÔÐÎËÎÂÍÀ',4931),
(232660,'ÌÀØ','ÅÂÃÅÍÈß','ÀËÅÊÑÀÍÄÐÎÂÍÀ',4495),
(137255,'ÁÐÅÄÈÕÈÍÀ','ÂÀÐÂÀÐÀ','ÏÅÒÐÎÂÍÀ',5181),
(253656,'ÑÀÌÎÐÎÄÎÂÀ','ÍÈÍÀ','ÀÍÄÐÅÅÂÍÀ',5462),
(205149,'×ÅÐÍÅÍÊÎ','ÀÍÍÀ','ÊÎÍÑÒÀÍÒÈÍÎÂÍÀ',4019),
(74026,'ÁÀÃÐÎÂÀ','ÒÀÒÜßÍÀ','ÈÂÀÍÎÂÍÀ',4763),
(302026,'ÏÐÎÄÀÓÑ','ÏÀÂÅË','ÏÅÒÐÎÂÈ×',5479),
(302243,'ÌÎÐÎÇÎÂÀ','ÈÓËÜßÍÈß','ÌÈÕÀÉËÎÂÍÀ',5312),
(285357,'ÊÎËÎÌÅÅÖ','ÑÒÅÏÀÍ','ÑÅÌÅÍÎÂÈ×',5270),
(167128,'ÏÎËßÍÑÊÈÉ','ÊÎÍÑÒÀÍÒÈÍ','ÏÀÂËÎÂÈ×',5443),
(286317,'ÊÓÐÎÏÀÒÊÈÍ','ÃÐÈÃÎÐÈÉ','ÈÂÀÍÎÂÈ×',4822),
(191776,'ÂÈÍÎÃÐÀÄÎÂ','ÄÌÈÒÐÈÉ','ÑÏÈÐÈÄÎÍÎÂÈ×',5298),
(291640,'ÑÈËÀÍÒÜÅÂÀ','ÔÅÄÎÐÀ','ÂÀÑÈËÜÅÂÍÀ',4793),
(211994,'ØÀÏÎÂÀËÎÂÀ','ÀÍÍÀ','ÍÈÊÎËÀÅÂÍÀ',4189),
(68268,'ÏÅÐÅËÛÃÈÍÀ','ÐÀÈÑÀ','ÔÅÄÎÐÎÂÍÀ',5296),
(294133,'ÖÈÁÈÇÎÂÀ','ÀËÅÊÑÀÍÄÐÀ','ÀËÅÊÑÀÍÄÐÎÂÍÀ',4461),
(293258,'ÊÎÌÈÑÑÀÐÎÂÀ','ÀÍÍÀ','ÁÎÐÈÑÎÂÍÀ',5199),
(125116,'ÒÀÌÈËÈÍÀ','ÌÀÐÈß','ÌÈÕÀÉËÎÂÍÀ',5361),
(267662,'ÃÎÍ×ÀÐÎÂÀ','ÑÅÐÀÔÈÌÀ','ÊÈÐÈËËÎÂÍÀ',4200),
(113825,'ÐÀÊØÈÍÀ','ÀËÅÊÑÀÍÄÐÀ','ÈÂÀÍÎÂÍÀ',4496),
(248643,'ÊÐÓÒÈÊÎÂÀ','ÅÊÀÒÅÐÈÍÀ','ÂÀÑÈËÜÅÂÍÀ',5442),
(100386,'ÍÈÊÎËÀÅÂÀ','ÀËÅÊÑÀÍÄÐÀ','ÍÈÊÈÒÈ×ÍÀ',5228),
(282175,'×ÓÌÀÊ','ÔÅÄÎÐ','ÃÐÈÃÎÐÜÅÂÈ×',5382),
(318398,'ÃËÀÄÊÎÂÀ','ÌÀÐÈß','ÈËÜÈÍÈ×ÍÀ',4880),
(318413,'ÌÈÐÎÅÄÎÂ','ÌÈÕÀÈË','ÂÀÑÈËÜÅÂÈ×',5061),
(340867,'ÏÈ×ÓÃÈÍÀ','ÎËÜÃÀ','ÄÌÈÒÐÈÅÂÍÀ',4879),
(341510,'ÊÓÇÍÅÖÎÂÀ','ÊÑÅÍÈß','ÍÈÊÈÒÈ×ÍÀ',4805),
(345854,'ÏÈÏÀ','ÀÍÍÀ','ÔÎÌÈÍÈ×ÍÀ',5285),
(360119,'ÂÀÐÊÎÂÀ','ÊËÀÂÄÈß','ÒÅÐÅÍÒÜÅÂÍÀ',3758),
(357822,'ÊÀÞÊÎÂÀ','ÀÍÍÀ','ÔÅÄÎÐÎÂÍÀ',5293),
(356877,'ÃÎÐÇÅÉ','ÏÅËÀÃÅß','ÏÎÒÀÏÎÂÍÀ',5284),
(313987,'ÇÈßËÎÂÀ','ÌÀÐÈß','ÅÔÀÍÎÂÍÀ',4719),
(339345,'ÊÓÐÑÊÎÂÀ','ÏÐÀÑÊÎÂÜß','ÄÅÍÈÑÎÂÍÀ',4668),
(378710,'ÊÓÄÀØÎÂÀ','ÀÍÍÀ','ÄÎÐÎÔÅÅÂÍÀ',4577),
(386205,'ËÎÏÀÒÈÍÀ','ÅÂÃÅÍÈß','ÏÀÂËÎÂÍÀ',4019),
(386843,'ÊÓÐÛØÈÍÀ','ËÞÁÎÂÜ','ÌÈÕÀÉËÎÂÍÀ',5009),
(433855,'ËÓÊÜßÍ×ÅÍÊÎ','ÑÀÐÐÀ','ÇÀÕÀÐÎÂÍÀ',5121),
(495330,'ÊÎËÅÄÈÍÎÂÀ','ÏÀÍÍÀ','ÍÈÊÈÒÈ×ÍÀ',5161),
(431569,'ÏÎÏÎÂÀ','ÔÅÒÈÍÈß','ÈÑÀÅÂÍÀ',3729),
(504213,'ÂËÀÑÎÂÀ','ÀÍÀÑÒÀÑÈß','ÂËÀÄÈÌÈÐÎÂÍÀ',5048),
(477000,'ÊÓÇÈÍÀ','ÂÅÐÀ','ÌÈÕÀÉËÎÂÍÀ',5475),
(488661,'ÊÎÌÀÍÄÈÍÀ','ÒÀÈÑÈß','ÃÐÈÃÎÐÜÅÂÍÀ',5400),
(497762,'ÇÀÉÖÅÂÀ','ÒÀÒÜßÍÀ','ÏÅÒÐÎÂÍÀ',4754),
(468975,'ØÈÐßÅÂÀ','ÍÀÄÅÆÄÀ','ÍÈÊÈÒÈ×ÍÀ',4555),
(468901,'ÊÓÁÀÍÖÅÂÀ','ÒÀÒÜßÍÀ','ÈÂÀÍÎÂÍÀ',4389),
(496501,'ÙÅÐÁÈÍÀ','ÀËÅÊÑÀÍÄÐÀ','ÀÍÄÐÅÅÂÍÀ',5225),
(421890,'ÑËÓÆÅÍÈÊÈÍÀ','ÍÀÒÀËÜß','ÔÅÄÎÐÎÂÍÀ',5334),
(415141,'ËÅÂÀ×ÅÂ','ÈÂÀÍ','ÈÂÀÍÎÂÈ×',5396),
(411785,'ÏÎÏÎÂÀ','ÎËÜÃÀ','ÄÀÍÈËÎÂÍÀ',4575),
(505965,'ÊÓÐÛØÅÂÀ','ÅËÈÇÀÂÅÒÀ','ÈÂÀÍÎÂÍÀ',4670),
(590960,'ØÀÉÊÈÍÀ','ÌÀÐÈß','ÀÔÀÍÀÑÜÅÂÍÀ',4499),
(536273,'ÍÀÌ','ÒÀÒÜßÍÀ','',3654),
(542935,'ÈËÜÈÍ','ÂÀÑÈËÈÉ','ÒÐÎÔÈÌÎÂÈ×',5207),
(601166,'ÔÈËÈÌÎÍÎÂÀ','ÌÀÒÐÅÍÀ','ÀÍÄÐÅßÍÎÂÍÀ',4590),
(613219,'ÑÒÓÊÀËÊÈÍÀ','ÏÐÎÑÊÎÂÜß','ÀÍÄÐÅÅÂÍÀ',5403),
(456712,'ØÈÍÊÀÐÅÍÎÊ','ÂÅÐÀ','ÂÈÊÅÍÒÜÅÂÍÀ',5208),
(544538,'ÊÐÓÏÏÀ','ÏÅËÀÃÅß','ÏÎËÈÊÀÐÏÎÂÍÀ',4494),
(555400,'ÑÎÑÍÎÂÑÊÀß','ÅÂÃÅÍÈß','ÔÅÄÎÐÎÂÍÀ',4642),
(543798,'ÏÐÎÍßÊÈÍÀ','ÈÐÈÍÀ','ÔÅÄÎÐÎÂÍÀ',4886),
(581728,'ÊÈÒÀÉÃÎÐÎÄÑÊÀß','ÀÍÍÀ','ÏÐÎÊÎÔÜÅÂÍÀ',4981),
(651719,'ØÓÒÎÂ','ÑÅÐÃÅÉ','ßÊÎÂËÅÂÈ×',4931),
(669128,'ÊÎÍÎÂÀËÎÂÀ','ËÞÁÎÂÜ','ÊÓÇÜÌÈÍÈ×ÍÀ',4726),
(642868,'ÊÍßÇÅÂÀ','ÏÐÀÑÊÎÂÜß','ÀÐÒÅÌÜÅÂÍÀ',4681),
(672419,'ÐßÁÈ×ÅÍÊÎ','ÒÀÈÑÈß','ÌÈÕÀÉËÎÂÍÀ',5395),
(686660,'ÂÎËÎÄÜÊÈÍÀ','ÅÔÐÎÑÈÍÈß','ÃÐÈÃÎÐÜÅÂÍÀ',4162),
(691171,'ÆÓËÈÍÀ','ÔÅÎÄÎÑÈß','ÅÔÈÌÎÂÍÀ',4628),
(709409,'ÊÀÏËÈÉ','ËÀÐÈÑÀ','ÑÒÅÔÀÍÎÂÍÀ',5230),
(717713,'ÒÈÒÎÂÀ','ÌÀÐÈß','ÍÈÊÎËÀÅÂÍÀ',5153),
(721463,'ÊÓÐÊÈÍÀ','ÅÔÐÎÑÈÍÜß','ÔÐÎËÎÂÍÀ',4750),
(724919,'ÊÎËÅÑÎÂÀ','ÌÀÏÐÈß','ÃÐÈÃÎÐÜÅÂÍÀ',5163),
(725003,'ÇÓÅÂÀ','ÂÀËÅÍÒÈÍÀ','ÃÐÈÃÎÐÜÅÂÍÀ',5154),
(734947,'ÑÀÂÅËÜÅÂÀ','ÍÀÒÀËÜß','ÈÂÀÍÎÂÍÀ',5069),
(734976,'ÊÓÇÜÌÈÍÀ','ÌÀÐÈß','ÂÀÑÈËÜÅÂÍÀ',5131),
(740483,'ÎÍÜÊÈÍÀ','ÀËÅÊÑÀÍÄÐÀ','ÈÂÀÍÎÂÍÀ',3767),
(761232,'ËÓÆÀÍÊÎÂÀ','ÊËÀÂÄÈß','ÈÂÀÍÎÂÍÀ',4541),
(823097,'ÁÅÑØÒÀÍÎÂÀ','ÀÍÀÑÒÀÑÈß','ÃÀÂÐÈËÎÂÍÀ',4693),
(822774,'ÄÎËÃÎÂÀ','ÒÀÈÑÈß','ÍÈÊÎËÀÅÂÍÀ',5296),
(822517,'ËÅÙÈÍÀ','ÒÀÈÑÀ','ÍÈÊÈÒÎÂÍÀ',5242),
(818445,'ÑÅÌÅÍÎÂÀ','ÅÊÀÒÅÐÈÍÀ','ÔÅÄÎÐÎÂÍÀ',4285),
(803447,'ÁÅËÎÂÀ','ÅËÅÍÀ','ÔÅÄÎÐÎÂÍÀ',4750),
(796907,'ÃÐÈØÈÍÀ','ÅÂÄÎÊÈß','ÏÀÂËÎÂÍÀ',5329),
(790623,'ÀÃÀÏÎÂÀ','ÌÀÐÈß','ÏÅÒÐÎÂÍÀ',4943),
(786184,'ÌÅÍÜÊÎÂÀ','ÌÀÐÔÀ','ÍÅÔÅÄÎÂÍÀ',3783),
(775611,'ÑÀÐÀÍ','ÃÐÈÃÎÐÈÉ','ÃÐÈÃÎÐÜÅÂÈ×',5037),
(775005,'ÊÐÈÓËÈÍÀ','ÌÀÐÈß','ÀÐÒÅÌÎÂÍÀ',5220),
(772351,'ÃÓÑÅÍÊÎ','ÊËÀÂÄÈß','ßÊÎÂËÅÂÍÀ',4884),
(765931,'ÐÅÑÍßÍÑÊÀß','ÒÀÒÜßÍÀ','ÑÅÐÃÅÅÂÍÀ',4795),
(765344,'ÃÐÀÌÎÒÅÅÂÀ','ÒÀÈÑÈß','ÀËÅÊÑÀÍÄÐÎÂÍÀ',5395),
(841507,'ÒÀÐÀÑ×ÅÂ','ÍÈÊÎËÀÉ','ÌÈÕÀÉËÎÂÈ×',4931),
(855056,'ÏÅÒÐÎÂÀ','ÊËÀÂÄÈß','ÂÀÑÈËÜÅÂÍÀ',4566),
(865065,'ÐÛÁÍÈÊÎÂÀ','ÀËÅÊÑÀÍÄÐÀ','ÍÀÓÌÎÂÍÀ',4632),
(968533,'ÐÎÃÎÆÈÍ','ÂÀÑÈËÈÉ','ÀÍÄÐÅÅÂÈ×',4983),
(880262,'ÏÀÐØÈÍÀ','ÌÀÐÈß','ÑÅÐÃÅÅÂÍÀ',4942),
(970810,'ÁÎËÄÛÐÅÂÀ','ÊËÀÂÄÈß','ÈÎÑÈÔÎÂÍÀ',5397),
(887047,'ÍÓÆÈÍÀ','ÅËÈÇÀÂÅÒÀ','ÏÀÂËÎÂÍÀ',5290),
(889144,'ÑËÀÁÓÍÎÂÀ','ÌÀÐÈß','ÏÀÂËÎÂÍÀ',4025),
(988036,'ÏÈÌÊÈÍÀ','ÍÀÒÀËÜß','ÍÈÊÎËÀÅÂÍÀ',5060),
(895401,'ÓÒÅÃÅÍÎÂÀ','ÊÓÌÛÑ','',5296),
(989568,'ÖÛÁÈÇÎÂÀ','ÀÍÍÀ','ÈÂÀÍÎÂÍÀ',5178),
(991803,'ÑÀÑÎÂÀ','ÌÀÐÈß','ÍÈÊÎËÀÅÂÍÀ',5296),
(899246,'ÏÐÎÑÂÈÐÎÂÀ','ÀÍÀÑÒÀÑÈß','ÀÊÈÌÎÂÍÀ',4931),
(907943,'ÇÀÉÖÅÂ','ÑÅÐÃÅÉ','ÅÃÎÐÎÂÈ×',5019),
(911779,'ÊÀÄÓÖÊÎÂÀ','ÊËÀÂÄÈß','ÈÂÀÍÎÂÍÀ',5469),
(913149,'ÎÐËÎÂÀ','ÇÈÍÀÈÄÀ','ÈÂÀÍÎÂÍÀ',5218),
(1016387,'ÝÄÅËÜØÒÅÉÍ','ÌÅÅÐ','ÂÓËÜÔÎÂÈ×',4815),
(914153,'ÊÀÐÍÀÓÕÎÂ','ÔÅÄÎÑ','ÑÅÐÃÅÅÂÈ×',4785),
(947928,'ÊÎÐÎÒÊÎÂÀ','ÍÈÍÀ','ÈÂÀÍÎÂÍÀ',4566),
(1003000,'ØÌÅËÅÂÀ','ÍÀÒÀËÜß','ÌÈÕÀÉËÎÂÍÀ',5296),
(1062409,'ËÅÎÍÀ','ÊËÀÂÄÈß','ÃÐÈÃÎÐÜÅÂÍÀ',5399),
(1079558,'ÈÑÀÅÂÀ','ÂÀËÅÍÒÈÍÀ','ÔÅÄÎÐÎÂÍÀ',4424),
(1031695,'ÅÐÌÎËÎÂÀ','ÂÀÑÈËÈÑÀ','ÏÐÎÊÎÔÜÅÂÍÀ',3886),
(1042503,'ÊÓÇÍÅÖÎÂ','ÀËÅÊÑÀÍÄÐ','ÏÐÎÊÎÔÜÅÂÈ×',5354),
(1043924,'ÀÍÓÔÐÈÅÂÀ','ÀÍÍÀ','ÌÈÕÀÉËÎÂÍÀ',4920),
(976313,'ÊÎÇÓÁ','ÅËÈÇÀÂÅÒÀ','ÑÅÌÅÍÎÂÍÀ',5331),
(987682,'ÁÓÄÀÐÈÍ','ÌÈÕÀÈË','ÈÂÀÍÎÂÈ×',5004),
(988858,'ÁÛÑÒÐÎÂÀ','ÂÀËÅÍÒÈÍÀ','ÍÈÊÎËÀÅÂÍÀ',5380),
(1061765,'×ÓÏÐÛÍÀ','ÌÀÒÐÅÍÀ','ÅÔÈÌÎÂÍÀ',5425),
(1068552,'ÅÐØÎÂÀ','ÂÅÐÀ','ÈÂÀÍÎÂÍÀ',4641),
(1069040,'ÊÓÐÊÈÍÀ','ÌÀÐÈß','ÂÀÑÈËÜÅÂÍÀ',5244),
(1052964,'ÂÈÄÈÍÅÅÂÀ','ÍÀÒÀËÜß','ÏÀÂËÎÂÍÀ',5339),
(945723,'ËÎÁÀÍÎÂÀ','ÌÀÐÈß','ÀËÅÊÑÀÍÄÐÎÂÍÀ',4230),
(960970,'ÍÀÇÀÐ×ÓÊ','ÏÐÀÑÊÎÂÜß','ÂÀÑÈËÜÅÂÍÀ',5245),
(1082021,'ÑÊÎÐÈÊÎÂÀ','ÒÀÒÜßÍÀ','ÔÅÄÎÐÎÂÍÀ',5122),
(1095547,'ÁÎÃÄÀÍÎÂÀ','ÑÒÅÔÀÍÈÄÀ','ÏÀÐÔÈÐÜÅÂÍÀ',5442),
(1112654,'ÑÞÇÅÂ','ÔÎÒÈÉ','ÊÀËÈÍÎÂÈ×',5351),
(1112974,'ÊÎØÅËÎÕÎÂÀ','ËÈÄÈß','ÌÈÕÀÉËÎÂÍÀ',5207),
(1119067,'ÈÎÍÎÂÀ','ÀÍÀÑÒÀÑÈß','ÀËÅÊÑÅÅÂÍÀ',5097),
(1126721,'ÁÎËÄÛÐÅÂÀ','ÀÍÒÎÍÈÍÀ','ÊÓÇÜÌÈÍÈ×ÍÀ',5319),
(1114420,'ÐÎÄÈÍÀ','ÊËÀÂÄÈß','ÀÐÒÅÌÎÂÍÀ',4822),
(1145891,'ØÈÐÎÊÎÂÀ','ÀËÅÊÑÀÍÄÐÀ','ÈÂÀÍÎÂÍÀ',4853),
(1163517,'ÏÎÏÎÂÀ','ÅÊÀÒÅÐÈÍÀ','ÌÈÕÀÉËÎÂÍÀ',5054),
(1172918,'ÊÐÈÂÖÎÂÀ','ÌÀÒÐÅÍÀ','ÍÈÊÎËÀÅÂÍÀ',5346),
(1181164,'ÊÀÌÅÍÎÂ','ÃÅÎÐÃÈÉ','ÍÈÊÎËÀÅÂÈ×',5219),
(1185202,'ÇÐßÍÈÍÀ','ÅÂÃÅÍÈß','ÄÅÌÈÄÎÂÍÀ',5296),
(1190912,'ÏÀÂËÎÂÀ','ÅÊÀÒÅÐÈÍÀ','ÔÈËÈÏÏÎÂÍÀ',5445),
(1192114,'ÁÎÐÎÄÊÈÍÀ','ÀËÅÊÑÀÍÄÐÀ','ÈÂÀÍÎÂÍÀ',5433),
(1193316,'ÍÈÄÇÈÉ','ÀÍÍÀ','ÌÈÕÀÉËÎÂÍÀ',5237),
(1198363,'ÑÀÌÎÉËÎÂÀ','ÒÀÈÑÈß','ÅÔÈÌÎÂÍÀ',5369),
(1198496,'ÁÓÍÈÍÀ','ÒÀÈÑÈß','ÀÍÄÐÅÅÂÍÀ',4245),
(1200726,'ÃÀÂÐÈËÎÂÀ','ÊÑÅÍÈß','ÏÀÂËÎÂÍÀ',5296),
(1201498,'ÃÎÐÅËÎÂ','ÀËÅÊÑÀÍÄÐ','ÈÂÀÍÎÂÈ×',5407),
(1205085,'ÁÎÆÊÎÂÀ','ÌÀÐÈß','ÏÀÍÒÈËÅÅÂÍÀ',4509),
(1206791,'ØÅÂ×ÅÍÊÎ','ÅÂÄÎÊÈß','ÌÀÒÂÅÅÂÍÀ',4200),
(1209279,'ÊÈÐÞÕÈÍÀ','ÂÅÐÀ','ßÊÎÂËÅÂÍÀ',5019),
(1210038,'ÊÎÐØÓÍÎÂ','ÈÂÀÍ','ÂÀÑÈËÜÅÂÈ×',5193),
(1213436,'ÏÀÐÀÌÎÍÎÂÀ','ÊËÀÂÄÈß','ÈÂÀÍÎÂÍÀ',4489),
(2945503,'ÑÈÇÎÍÅÍÊÎ','ÌÀÒÐÅÍÀ','ÑÅÐÃÅÅÂÍÀ',3613),
(2993199,'ÌÅÄÂÅÄÅÂ','ÊÎÍÑÒÀÍÒÈÍ','ÑÅÌÅÍÎÂÈ×',3364),
(2993449,'ÄÐÎÇÄÎÂÀ','ÅÂÄÎÊÈß','ÑÅÐÃÅÅÂÍÀ',3359),
(2962218,'ÏÅÐÅÂßÇÊÈÍÀ','ÈÐÈÍÀ','ÄÌÈÒÐÈÅÂÍÀ',2676)) v(PID,Fam,IM,Ot,DR)


SELECT l.filialName AS [Ôèëèàë],f.CodeM AS [Êîä ÌÎ],l.Namef AS [Íàèìåíîâàíèå ÌÎ],p.Fam +' '+ p.Im+' '+ p.OT AS [ÔÈÎ]
		, p.DR AS [Äàòà ðîæäåíèÿ],c.DateBegin AS [Äàòà íà÷àëî],c.DateEnd AS [Äàòà îêîí÷àíèÿ],v006.name AS [Óñëîâèÿ îêàçàíèÿ]
		,a.Account AS [¹ ñ÷åòà],a.DateRegister AS [Äàòà ñ÷åòà],c.idRecordCase AS [¹ ñëó÷àÿ]
		,a.ReportMonth AS [Îò÷åòíûé ìåñÿö],CAST(c.AmountPayment AS MONEY)  AS [Ñòîèìîñòü ñëó÷àÿ]
FROM dbo.t_Case_PID_ENP ce INNER JOIN #searchPeople p ON
			ce.PID=p.PID
						INNER JOIN t_Case c ON
			ce.rf_idCase=c.id
						INNER JOIN dbo.t_RecordCasePatient rp ON
			c.rf_idRecordCasePatient=rp.id
						INNER JOIN dbo.t_RegistersAccounts a ON
			rp.rf_idRegistersAccounts=a.id
						INNER JOIN dbo.t_File f ON
			a.rf_idFiles=f.id
						INNER JOIN dbo.vw_sprT001 l ON
			f.CodeM=l.CodeM
						INNER JOIN RegisterCases.dbo.vw_sprV006 v006 ON
			c.rf_idV006=v006.id						
WHERE ce.ReportYear=2014 AND f.DateRegistration>'20140101' AND f.DateRegistration<'20150114'
UNION 
SELECT l.filialName AS [Ôèëèàë],f.CodeM AS [Êîä ÌÎ],l.Namef AS [Íàèìåíîâàíèå ÌÎ],p.Fam +' '+ p.Im+' '+ p.OT AS [ÔÈÎ]
		, p.DR AS [Äàòà ðîæäåíèÿ],c.DateBegin AS [Äàòà íà÷àëî],c.DateEnd AS [Äàòà îêîí÷àíèÿ],v006.name AS [Óñëîâèÿ îêàçàíèÿ]
		,a.Account AS [¹ ñ÷åòà],a.DateRegister AS [Äàòà ñ÷åòà],c.idRecordCase AS [¹ ñëó÷àÿ]
		,a.ReportMonth AS [Îò÷åòíûé ìåñÿö],CAST(c.AmountPayment AS MONEY)  AS [Ñòîèìîñòü ñëó÷àÿ]
FROM dbo.t_File f INNER JOIN dbo.t_RegistersAccounts a ON
					f.id=a.rf_idFiles
				  INNER JOIN dbo.t_RecordCasePatient r ON
					a.id=r.rf_idRegistersAccounts
				  INNER JOIN dbo.t_RegisterPatient p1 ON
					r.id=p1.rf_idRecordCase
					AND p1.rf_idFiles=f.id
				  INNER JOIN #searchPeople p ON
					p1.Fam=p.Fam
					AND p1.Im=p.Im
					AND ISNULL(p1.Ot,'')=ISNULL(p.Ot,'')
				  INNER JOIN t_Case c ON
					r.id=c.rf_idRecordCasePatient						
						INNER JOIN dbo.vw_sprT001 l ON
			f.CodeM=l.CodeM
						INNER JOIN RegisterCases.dbo.vw_sprV006 v006 ON
			c.rf_idV006=v006.id						
WHERE a.ReportYear=2014 AND f.DateRegistration>'20140101' AND f.DateRegistration<'20150114'
ORDER BY filialName

go

DROP TABLE #searchPeople			
